# BuiltInFailures.NumberingFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..NumberingFailures Class
BuiltInFailures Class Members See Also
---
Failures related to object numbering operations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class NumberingFailures
```

Visual Basic
---
```text
Public NotInheritable Class NumberingFailures
```

Visual C++
---
```text
public ref class NumberingFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..NumberingFailures
# See Also
BuiltInFailures..::..NumberingFailures Members
Autodesk.Revit.DB Namespace